app/Controllers/Artikel.php

    public function index()
    {
        $title = 'Daftar Artikel';
        $artikel = $artikelModel = new ArtikelModel();

        // Jika pakai getArtikelWithKategoriQuery()
        $artikel = $artikelModel->getArtikelWithKategoriFiltered()->findAll();
---
SELECT *
FROM `artikel`

       public function indexadmin()
    {
        $title = 'Daftar Artikel';
        $model = new ArtikelModel();
        $artikel = $model->findAll(); // Mengambil semua artikel
---
SELECT *
FROM `artikel`

    public function view($slug)
    {
    $model = new ArtikelModel();
    $data['artikel'] = $model->where('slug', $slug)->first();
---
SELECT *
FROM `artikel`
WHERE `slug` = 'artikel-kedua'
 LIMIT 1

    public function admin_index()
    {
        $title = 'Daftar Artikel (Admin)';
        $model = new ArtikelModel();

        $q = $this->request->getVar('q') ?? '';
        $kategori_id = $this->request->getVar('kategori_id') ?? '';
        $page = $this->request->getVar('page') ?? 1;

        // Query builder
        $builder = $model->table('artikel')
            ->select('artikel.*, kategori.nama_kategori')
            ->join('kategori', 'kategori.id_kategori = artikel.id_kategori')
            ->orderBy('artikel.id', 'ASC');

        if (!empty($q)) {
            $builder->like('artikel.judul', $q);
        }

        if (!empty($kategori_id)) {
            $builder->where('artikel.id_kategori', $kategori_id);
        }

        $artikel = $builder->paginate(5, 'default', $page);
---
SELECT *
FROM `kategori`
SELECT COUNT(*) AS `numrows`
FROM `artikel`
JOIN `kategori` ON `kategori`.`id_kategori` = `artikel`.`id_kategori`
SELECT `artikel`.*, `kategori`.`nama_kategori`
FROM `artikel`
JOIN `kategori` ON `kategori`.`id_kategori` = `artikel`.`id_kategori`
ORDER BY `artikel`.`id` ASC
 LIMIT 5

            ]);
        } else {
            $kategoriModel = new \App\Models\KategoriModel();
            $data['kategori'] = $kategoriModel->asArray()->findAll();
---
SELECT *
FROM `kategori`

    // Ambil data lama + kategori untuk form
    $data = $artikel->where('id', $id)->first();
    $kategoriModel = new \App\Models\KategoriModel();
    $kategori = $kategoriModel->findAll();
---
SELECT *
FROM `kategori`