app/Controllers/Artikel.php

    public function admin_index()
    {
        $title = 'Daftar Artikel';
        $model = new ArtikelModel();
        $artikel = $model->findAll(); // Mengambil semua artikel
---
SELECT *
FROM `artikel`

public function edit($id)
{
    // Membuat instance model ArtikelModel
    $model = new ArtikelModel();

    // Cari artikel berdasarkan ID
    $artikel = $model->find($id);
---
SELECT *
FROM `artikel`
WHERE `artikel`.`id` = '1'